package laba_3.task3;

import java.io.IOException;

/*
* Задание 3: создайте клиент-серверное приложение “Архив”.
Общие требования к заданию:
• В архиве хранятся Дела (например, студентов). Архив находится на сервере.
• Клиент, в зависимости от прав, может запросить дело на просмотр, внести в
него изменения, или создать новое дело.
Требования к коду лабораторной работы:
• Для реализации сетевого соединения используйте сокеты.
• Формат хранения данных на сервере – xml-файлы.
* */
public class Main {
    public static void main(String[] args) throws IOException {

//        System.out.println(ParserXML.readXML());

//        List<Student> students = new ArrayList<>();
//        students.add(new Student("Vasy", 2, "kj;kj;kj;"));
//        students.add(new Student("Vaee", 4, "kjasdajasd"));
//        students.add(new Student("Vasdaee", 3, "kjasddasdfajasd"));
//        ParserXML.writeXML(students);

        //1.ЗапускаемServer
        //2.ЗапускаемClient
        //3.ЗапускаемArchivariusBot

        //Задание выполнено примерно на ~70%;

    }
}
